Задача:

Дан массив целых чисел в диапазоне от -30000 до 30000. Отсортировать его по возрастанию. Методом простого выбора.

Формат ввода:

В первой строке - количество элементов массива не превосходящее 100. На второй строке через пробел элементы массива.

Формат вывода:

Элементы отсортированного массива на одной строке через пробел.

Пример входных данных

5
4 3 5 1 2  
Пример выходных данных

1 2 3 4 5

```pascal
type
  mas = array[1..1000] of longint;

function findmin(x: mas; start, n: longint): longint;
var
  i, nmin: longint;
begin
  nmin := start;
  for i := start + 1 to N do
    if x[i] < x[nmin] then
      nmin := i;
  findmin := nmin
end;

procedure change(var one, two: longint);
var
  temp: longint;
begin
  temp := one;
  one := two;
  two := temp
end;

var
  i, k, n: longint;
  a: mas;

begin
  readln(n);
  for i := 1 to n do
    read(a[i]);
  for i := 1 to n - 1 do 
  begin
    k := findmin(a, i, n); 
    change(a[k], a[i]);
  end;
  for i := 1 to n do
    write(a[i],' ')
end.
```

| Ввод                                                  | Ожидаемый                                          | Получено                                           |
|-------------------------------------------------------|----------------------------------------------------|----------------------------------------------------|
| 5 4 3 5 1 2                                           | 1 2 3 4 5                                          | 1 2 3 4 5                                          |
| 1 100                                                 | 100                                                | 100                                                |
| 13 4444 -76 5 -5 10000 11 55 99 456 876 123 3333 8888 | -76 -5 5 11 55 99 123 456 876 3333 4444 8888 10000 | -76 -5 5 11 55 99 123 456 876 3333 4444 8888 10000 |
