Задача:

Дан массив символьных строк. Найти строку в которой наибольшее количество знаков арифметических операций: +, -, *, /.

Если таких строк несколько - взять первую.

Формат ввода:

В первой строке - количество элементов массива не превосходящее 100. На второй и последующих строках элементы массива.

Формат вывода:

Строка - искомый элемент массива.

Пример входных данных

3  
abc+1fk8  
b -12 - c  
ab8 *2k  
Пример выходных данных

b -12 - c

```pascal
type
  IntMas = array[1..100] of longint;
type
  StrMas = array[1..100] of string;

function findMaxIndex(arr : IntMas; size : longint) : longint;
var
  i, currval, currindex : longint;
begin
  currval := 0;
  currindex := 1;
  for i := 1 to size do
    if arr[i] > currval then
    begin
      currindex := i;
      currval := arr[i];
    end;
  findMaxIndex := currindex;
end;

function countSymbols(s : string) : longint;
var
  i, sum : longint;
  ts : string;
begin
  sum := 0;
  for i := 1 to length(s) do
  begin
    ts := copy(s, i, 1);
    if (ts = '+') or (ts = '-') or (ts = '*') or (ts = '/') then
      sum += 1;
  end;
  countSymbols := sum;
end;

var
  n, i : longint;
  iarr : IntMas;
  sarr : StrMas;
  temps : string;
begin
  readln(n);
  for i := 1 to n do
  begin
    readln(temps);
    sarr[i] := temps;
    iarr[i] := countSymbols(temps);
  end;
  writeln(sarr[findMaxIndex(iarr, n)]);
end.
```

| Ввод                                                       | Ожидаемый        | Получено         |
|------------------------------------------------------------|------------------|------------------|
| 3<br/>abc+1fk8<br/>b -12 - c<br/>ab8 *2k                   | b -12 - c        | b -12 - c        |
| 3<br/>a3adn f ks44SDkg<br/>nm, nxS1sd,fn ad<br/>kfjdjjs111 | a3adn f ks44SDkg | a3adn f ks44SDkg |
| 4<br/>1-<br/>2++<br/>3***<br/>4/                           | 3***             | 3***             |

