Задача:

Дан массив символьных строк. В строках нечетной длинны заменить все малые латинские буквы на большие.

Формат ввода:

В первой строке - количество элементов массива не превосходящее 100. На второй и последующих строках элементы массива.

Формат вывода:

Построчно распечатанный массив.

Пример входных данных

3  
a  
bc  
def  
Пример выходных данных

A  
bc  
DEF

```pascal
type
  StrMas = array[1..100] of string;
const
  smallLatin = 'abcdefghijklmnopqrstuvwxyz';
const
  capsLatin = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ';

procedure process(var arr : StrMas; size : longint);
var
  i, j, tpos : longint;
begin
  for i := 1 to size do
    if length(arr[i]) mod 2 = 1 then
      for j := 1 to length(arr[i]) do
      begin
        tpos := pos(copy(arr[i], j, 1), smallLatin);
        if tpos <> 0 then
        begin
          delete(arr[i], j, 1);
          insert(capsLatin[tpos], arr[i], j);
        end;
      end;
end;

var
  i, n : longint;
  sarr : StrMas;
begin
  readln(n);
  for i := 1 to n do
    readln(sarr[i]);
  process(sarr, n);
  for i := 1 to n do
    writeln(sarr[i]);
end.
```

| Ввод                        | Ожидаемый              | Получено          |
|-----------------------------|------------------------|-------------------|
| 3<br/>a<br/>bc<br/>def      | A<br/>bc<br/>DEF       | A<br/>bc<br/>DEF  |

