Задача:

Дан массив целых чисел в диапазоне от -10000 до 10000. Вычислить количество элементов массива меньших n и это значение прибавить к каждому элементу массива равному m. Числа n, m лежат в пределах от -10000 до 10000.

Формат ввода:

В первой строке - количество элементов массива не превосходящее 100. На второй строке через пробел элементы массива. На третьей строке числа n, m записанные через пробел.

Формат вывода:

Элементы массива на одной строке через пробел.

```pascal
var
  arr: array[1..100] of longint;
  i, l, n, m, counter: longint;
begin
  // Reading
  readln(l);
  for i := 1 to l do begin
    read(arr[i]);
  end;
  read(n);
  read(m);
  
  // Handle
  counter := 0;
  for i := 1 to l do begin
    if arr[i] < n then begin
      counter += 1;
    end;
  end;
  for i := 1 to l do begin
    if arr[i] = m then begin
      arr[i] += counter;
    end;
  end;
  
  // Printing
  for i := 1 to l do begin
    write(arr[i], ' ');
  end;
end.
```