Напишите программу, которая переводит натуральное число n в систему счисления с заданным основанием d.

Входные данные:

На вход программы подаются два числа: n и d, 2 ≤ d ≤ 16, 1 ≤ n < 231.

Выходные данные:

Программа должна вывести запись числа n в системе счисления с основанием d. Буквенные цифры при этом должны быть в
верхнем регистре.

Для примера:

| Ввод   | Результат |
|--------|-----------|
| 123 10 | 123       |
| 5 2    | 101       |
| 30 16  | 1E        |

```pascal
function ConvertCC(
         x:string;
         toCC:longint
):String;
const
  abc='0123456789ABCDEF';
var
 i,k,ten,stp:longint;
begin
 ten:=0;
 stp:=1;
 ConvertCC:='';

 for i:=Length(x) downto 1 do begin
   k:=Pos(copy(x, i, 1),abc)-1;
   ten:=ten+k*stp;
   stp:=stp*10;
 end;

 while ten<>0 do begin
   i:=ten mod toCC;
   ConvertCC:=copy(abc, i+1, 1)+ConvertCC;
   ten:=ten div toCC;
 end;
end;

var inp_num, inp_cc: string; l,cc,i:longint;
begin
  readln(inp_num);
  i := 1;
  if pos(' ', inp_num) = 0 then begin
    readln(inp_cc);
    Val(inp_cc, cc, l);
    writeln(ConvertCC(inp_num, cc));
  end else begin
    for i := 1 to Length(inp_num) do begin
      if copy(inp_num, i, 1) = ' ' then begin
        Val(copy(inp_num, i+1, Length(inp_num)-i), cc, l);
        writeln(ConvertCC(copy(inp_num, 1, i-1), cc));
      end;
    end;
  end;
end.
```

| Ввод   | Ожидаемый | Получено |
|--------|-----------|----------|
| 123 10 | 123       | 123      |
| 5 2    | 101       | 101      |
| 30 16  | 1E        | 1E       |