Написать программу, которая перед каждой маленькой английской буквой в строке вставит последовательность из английского алфавита, начиная с буквы «a» и до рассматриваемой буквы в строке. Перед буквой «a» в строке ничего ставить не надо.

Примечание

Английский алфавит: abcdefghijklmnopqrstuvwxyz.

Для примера:

| Ввод | Результат |
|------|-----------|
| abc  | aababc    |

```pascal
program smallLetterExtender;
var input, d, e, abc: string; i, a, b, c: longint;
begin
  abc := 'abcdefghijklmnopqrstuvwxyz';
  readln(input);
  b := length(input); 
  i := 1;
  while i <= b do
    if pos(copy(input, i, 1), abc) <> 0 then begin
      for a := 1 to length(abc) do
        if copy(abc, a, 1) = copy(input, i, 1) then begin
          Insert(copy(abc, 0, a), input, i);
          Delete(input, i+length(copy(abc, 0, a)), 1);
          i += length(copy(abc, 0, a));
          b := length(input);
        end
     end else i += 1;
   writeln(input);
end.
```